/*********************************************************************************************
*                                                                                            *
* Problem 13:                                                                                *
*          홀수 짝수                                                                         *
*                                                                                            *
*********************************************************************************************/

/*********************************************************************************************
*                                                                                            *
* 국민대학교 전자정보통신대학 컴퓨터공학부 1학년                                             *
*                                                                20143053 남규현             *
*                                                                                            *
*********************************************************************************************/

#include <stdio.h>
#include <stdlib.h>

#pragma warning (disable : 4996)

void main(void)
{
	FILE *fp;
	int no_cases, no_data, data;
	int on, en;
	int i, j;

	fp = fopen("input.txt", "r");
	if (fp == NULL) exit(1);

	fscanf(fp, "%d", &no_cases); // 테스트 반복 횟수 읽어옴

	for (i = 0; i < no_cases; i++) // 테스트 반복
	{
		fscanf(fp, "%d", &no_data); // 케이스의 자연수 개수
		on = en = 0;

		for (j = 0; j < no_data; j++) // 자연수 개수 만큼 반복
		{
			fscanf(fp, "%d", &data); // 데이타 읽어옴

			(data % 2 == 0) ? (en += 1) : (on += 1); // 홀짝 판별
		}

		printf("%d %d\n", on, en); // 홀수 짝수 개수 출력
	}

	fclose(fp);
}